Duet3D/Duet3Expansion/src/atmel/SAMS70_DFP/2.3.88/sams70b/include/component/pio.h
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

#define PIO_PCIDR_OFFSET                    (0x158)                                       /**<  (PIO_PCIDR) Parallel Capture Interrupt Disable Register  Offset */

#define PIO_PCIDR_DRDY_Pos                  0                                              /**< (PIO_PCIDR) Parallel Capture Mode Data Ready Interrupt Disable Position */
#define PIO_PCIDR_DRDY_Msk                  (_U_(0x1) << PIO_PCIDR_DRDY_Pos)               /**< (PIO_PCIDR) Parallel Capture Mode Data Ready Interrupt Disable Mask */
#define PIO_PCIDR_DRDY                      PIO_PCIDR_DRDY_Msk                             /**< \deprecated Old style mask definition for 1 bit bitfield. Use PIO_PCIDR_DRDY_Msk instead */
#define PIO_PCIDR_OVRE_Pos                  1                                              /**< (PIO_PCIDR) Parallel Capture Mode Overrun Error Interrupt Disable Position */
#define PIO_PCIDR_OVRE_Msk                  (_U_(0x1) << PIO_PCIDR_OVRE_Pos)               /**< (PIO_PCIDR) Parallel Capture Mode Overrun Error Interrupt Disable Mask */
#define PIO_PCIDR_OVRE                      PIO_PCIDR_OVRE_Msk                             /**< \deprecated Old style mask definition for 1 bit bitfield. Use PIO_PCIDR_OVRE_Msk instead */
#define PIO_PCIDR_ENDRX_Pos                 2                                              /**< (PIO_PCIDR) End of Reception Transfer Interrupt Disable Position */
#define PIO_PCIDR_ENDRX_Msk                 (_U_(0x1) << PIO_PCIDR_ENDRX_Pos)              /**< (PIO_PCIDR) End of Reception Transfer Interrupt Disable Mask */
#define PIO_PCIDR_ENDRX                     PIO_PCIDR_ENDRX_Msk                            /**< \deprecated Old style mask definition for 1 bit bitfield. Use PIO_PCIDR_ENDRX_Msk instead */
#define PIO_PCIDR_RXBUFF_Pos                3                                              /**< (PIO_PCIDR) Reception Buffer Full Interrupt Disable Position */
#define PIO_PCIDR_RXBUFF_Msk                (_U_(0x1) << PIO_PCIDR_RXBUFF_Pos)             /**< (PIO_PCIDR) Reception Buffer Full Interrupt Disable Mask */
#define PIO_PCIDR_RXBUFF                    PIO_PCIDR_RXBUFF_Msk                           /**< \deprecated Old style mask definition for 1 bit bitfield. Use PIO_PCIDR_RXBUFF_Msk instead */
#define PIO_PCIDR_MASK                      _U_(0x0F)                                      /**< \deprecated (PIO_PCIDR) Register MASK  (Use PIO_PCIDR_Msk instead)  */
#define PIO_PCIDR_Msk                       _U_(0x0F)                                      /**< (PIO_PCIDR) Register Mask  */


/* -------- PIO_PCIMR : (PIO Offset: 0x15c) (R/ 32) Parallel Capture Interrupt Mask Register -------- */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t DRDY:1;                    /**< bit:      0  Parallel Capture Mode Data Ready Interrupt Mask */
    uint32_t OVRE:1;                    /**< bit:      1  Parallel Capture Mode Overrun Error Interrupt Mask */
    uint32_t ENDRX:1;                   /**< bit:      2  End of Reception Transfer Interrupt Mask */
    uint32_t RXBUFF:1;                  /**< bit:      3  Reception Buffer Full Interrupt Mask     */
    uint32_t :28;                       /**< bit:  4..31  Reserved */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} PIO_PCIMR_Type;
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

#define PIO_PCIMR_OFFSET                    (0x15C)                                       /**<  (PIO_PCIMR) Parallel Capture Interrupt Mask Register  Offset */

#define PIO_PCIMR_DRDY_Pos                  0                                              /**< (PIO_PCIMR) Parallel Capture Mode Data Ready Interrupt Mask Position */
#define PIO_PCIMR_DRDY_Msk                  (_U_(0x1) << PIO_PCIMR_DRDY_Pos)               /**< (PIO_PCIMR) Parallel Capture Mode Data Ready Interrupt Mask Mask */
#define PIO_PCIMR_DRDY                      PIO_PCIMR_DRDY_Msk                             /**< \deprecated Old style mask definition for 1 bit bitfield. Use PIO_PCIMR_DRDY_Msk instead */
#define PIO_PCIMR_OVRE_Pos                  1                                              /**< (PIO_PCIMR) Parallel Capture Mode Overrun Error Interrupt Mask Position */
#define PIO_PCIMR_OVRE_Msk                  (_U_(0x1) << PIO_PCIMR_OVRE_Pos)               /**< (PIO_PCIMR) Parallel Capture Mode Overrun Error Interrupt Mask Mask */
#define PIO_PCIMR_OVRE                      PIO_PCIMR_OVRE_Msk                             /**< \deprecated Old style mask definition for 1 bit bitfield. Use PIO_PCIMR_OVRE_Msk instead */
#define PIO_PCIMR_ENDRX_Pos                 2                                              /**< (PIO_PCIMR) End of Reception Transfer Interrupt Mask Position */
#define PIO_PCIMR_ENDRX_Msk                 (_U_(0x1) << PIO_PCIMR_ENDRX_Pos)              /**< (PIO_PCIMR) End of Reception Transfer Interrupt Mask Mask */
#define PIO_PCIMR_ENDRX                     PIO_PCIMR_ENDRX_Msk                            /**< \deprecated Old style mask definition for 1 bit bitfield. Use PIO_PCIMR_ENDRX_Msk instead */
#define PIO_PCIMR_RXBUFF_Pos                3                                              /**< (PIO_PCIMR) Reception Buffer Full Interrupt Mask Position */
#define PIO_PCIMR_RXBUFF_Msk                (_U_(0x1) << PIO_PCIMR_RXBUFF_Pos)             /**< (PIO_PCIMR) Reception Buffer Full Interrupt Mask Mask */
#define PIO_PCIMR_RXBUFF                    PIO_PCIMR_RXBUFF_Msk                           /**< \deprecated Old style mask definition for 1 bit bitfield. Use PIO_PCIMR_RXBUFF_Msk instead */
#define PIO_PCIMR_MASK                      _U_(0x0F)                                      /**< \deprecated (PIO_PCIMR) Register MASK  (Use PIO_PCIMR_Msk instead)  */
#define PIO_PCIMR_Msk                       _U_(0x0F)                                      /**< (PIO_PCIMR) Register Mask  */


/* -------- PIO_PCISR : (PIO Offset: 0x160) (R/ 32) Parallel Capture Interrupt Status Register -------- */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t DRDY:1;                    /**< bit:      0  Parallel Capture Mode Data Ready         */
    uint32_t OVRE:1;                    /**< bit:      1  Parallel Capture Mode Overrun Error      */
    uint32_t :30;                       /**< bit:  2..31  Reserved */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} PIO_PCISR_Type;
